app/controllers/project_controller.rb

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def gossip
    @id = params[:id]
    @title = Gossip.find(params['id']).title
    @content = Gossip.find(params['id']).content
    @user = Gossip.find(params['id']).user